src/OneSBuild/src/InformationRegisters/АвторизацияВСервисе1СФреш/АвторизацияВСервисе1СФреш.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>АвторизацияВСервисе1СФреш</name>
  <resources>
    <name>Логин</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>КодАбонента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/OneSBuild/src/InformationRegisters/АвторизацияВСервисе1СФреш/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьЗапись(Пользователь, Логин, Пароль, КодАбонента) Экспорт
	
	Набор = СоздатьНаборЗаписей();
	Набор.ДополнительныеСвойства.Вставить("Пароль", Пароль);
	Набор.Отбор.Пользователь.Установить(Пользователь);
	Запись = Набор.Добавить();
	Запись.Пользователь = Пользователь;
	Запись.Логин = Логин;
	Запись.КодАбонента = КодАбонента;
	Набор.Записать();
	
КонецПроцедуры

Функция ВладелецБезопасногоХранилища(Пользователь) Экспорт
	
	ИДПользователя = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Пользователь, "ИдентификаторПользователяИБ");
	Возврат СтрШаблон("Пользователь_%1", ИДПользователя);
	
КонецФункции
  
Функция Прочитать(Пользователь) Экспорт
	
	Менеджер = СоздатьМенеджерЗаписи();
	Менеджер.Пользователь = Пользователь;
	Менеджер.Прочитать();
	
	Данные = Новый Структура;
	Данные.Вставить("Логин", Менеджер.Логин);
	
	УстановитьПривилегированныйРежим(Истина);
	Владелец = ВладелецБезопасногоХранилища(Пользователь);
	Данные.Вставить("Пароль", ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(Владелец));
	Данные.Вставить("КодАбонента", Менеджер.КодАбонента);
	
	Возврат Данные;
	
КонецФункции
 
#КонецОбласти 
 
#КонецЕсли
